package com.mahmoudmabrok.azakri.DataSet;

import com.mahmoudmabrok.azakri.Zeker;

import java.util.ArrayList;

/**
 * Created by motamed on 3/26/2018.
 */

public class Data {


    private ArrayList<Zeker> sabah = new ArrayList<>();
    private ArrayList<Zeker> masa = new ArrayList<>();

    public Data() {
        prepareData();
    }

    private void prepareData() {

        //region Sabah
        sabah.add(new Zeker("أصبحنا على فِطْرََةِ " +
                "الإِسلام وكَلِمةِ الاخلاصِ ,ودينِ نَبِيِّنا محمدٍ ﷺ ,ومِلَّةِ أبينا إبراهيمً حنيفًا مسلمًا,وما كان من المشركين."));

        sabah.add(new Zeker(" رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ ﷺ نَبِيّـاً . (ثلاثاً) ", 3));

        sabah.add(new Zeker(" اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور. "));

        sabah.add(new Zeker(" يا حَـيُّ يا قَيّـومُ بِـرَحْمَـتِكِ أَسْتَـغـيث ، أَصْلِـحْ لي شَـأْنـي كُلَّـه ، وَلا تَكِلـني إِلى نَفْـسي طَـرْفَةَ عَـين ."));

        sabah.add(new Zeker("اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ " +
                "وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ" +
                " بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ"));

        sabah.add(new Zeker(" اللّهُـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت " +
                "، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ . "));

        sabah.add(new Zeker(" اللّهُـمَّ فَاطِرَ السَمَاواتِ والأرضِ ،عالِـمَ الغَـيْبِ وَالشّـهادَةِ ،رب " +
                "كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي" +
                " وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. "));

        sabah.add(new Zeker(" أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله " +
                "، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ،" +
                " رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ هـذا اليوم وَشَرِّ ما بَعْـدَه،" +
                " رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."));

        sabah.add(new Zeker(" اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أَُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتِك ، " +
                "وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك .(أربع مرات ) ", 4));

        sabah.add(new Zeker(" اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة " +
                "، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، " +
                "اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي " +
                "وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي . "));

        sabah.add(new Zeker("أصبحتُ أُثني عليك حمدًا،وأشهد أن لا إله إلا الله " +
                "(ثلاثاً) ", 3));

        //
        sabah.add(new Zeker(" أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق . (ثلاثا)", 3));

        sabah.add(new Zeker(" بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم . (ثلاثاً) ", 3));

        sabah.add(new Zeker(" سُبْحـانَ اللهِ عَدَدَ خَلْـقِه ، سُبْحـانَ اللهِ َرِضـا نَفْسِـه" +
                " ،  سُبْحـانَ اللهِ َزِنَـةَ عَـرْشِـه ، سُبْحـانَ اللهِ  مِـدادَ كَلِمـاتِـه . (ثلاثاً) ", 3));

        sabah.add(new Zeker(" اللّهُـمَّ عافِـني في بَدَنـي " +
                "، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ . (ثلاثاً) ", 3));

        sabah.add(new Zeker("اللّهُـمَّ إِنّـي أَعـوذُبِكَ مِنَ الْكُـفر " +
                "، وَالفَـقْر ، واللّهُـمَّ إِنّـي َأَعـوذُبِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ . (ثلاثاً) ", 3));

        sabah.add(new Zeker("سور [ الإخلاص والفلق والناس ]  (ثلاثا)", 3));

        sabah.add(new Zeker(" حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم . ( سبع مَرّات ) ", 7));

        sabah.add(new Zeker(" لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شَـريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْـد، وهُوَ على كُلّ شَيءٍ قَدير . (عشر مرات) ", 10));

        sabah.add(new Zeker("اللهم صَلِّ على سيدنا محمدِ (عشر مرات)", 10));

        sabah.add(new Zeker(" سُبْحـانَ اللهِ وَبِحَمْـدِهِ . (مائة مرة) ", 100));


       /* sabah.add(new Zeker(" اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ" +
                " أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر . "));

        sabah.add(new Zeker(" أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ " +
                "، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه . "));
       */

        //endregion


        //region Masa
        masa.add(new Zeker("أمسينا على فِطْرََةِ " +
                "الإِسلام وكَلِمةِ الاخلاصِ ,ودينِ نَبِيِّنا محمدٍ ﷺ ,ومِلَّةِ أبينا إبراهيمً حنيفًا مسلمًا,وما كان من المشركين."));

        masa.add(new Zeker(" رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ ﷺ نَبِيّـاً . (ثلاثاً) ", 3));

        masa.add(new Zeker(" اللّهُـمَّ بِكَ أَمْسَـينا، وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا، وَبِكَ نَمـوتُ وَإِلَـيْكَ المَصـير . "));

        masa.add(new Zeker(" يا حَـيُّ يا قَيّـومُ بِـرَحْمَـتِكِ أَسْتَـغـيث ، أَصْلِـحْ لي شَـأْنـي كُلَّـه ، وَلا تَكِلـني إِلى نَفْـسي طَـرْفَةَ عَـين ."));

        masa.add(new Zeker("اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ " +
                "وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ" +
                " بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ"));

        masa.add(new Zeker(" اللّهُـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت " +
                "، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ . "));

        masa.add(new Zeker(" اللّهُـمَّ فَاطِرَ السَمَاواتِ والأرضِ ،عالِـمَ الغَـيْبِ وَالشّـهادَةِ ،رب " +
                "كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي" +
                " وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. "));


        masa.add(new Zeker(" أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، " +
                "وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا " +
                "، وَأَعـوذُ بِكَ مِنْ شَـرِّ هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ" +
                " الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر ."));

        masa.add(new Zeker(" اللّهُـمَّ إِنِّـي أَمْسَيتُ أَُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتِك ، " +
                "وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك .(أربع مرات ) ", 4));

        masa.add(new Zeker(" اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة " +
                "، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، " +
                "اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي " +
                "وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي . "));

        masa.add(new Zeker("أمْسَيتُ أُثني عليك حمدًا،وأشهد أن لا إله إلا الله  " +
                "(ثلاثاً) ", 3));

        //
        masa.add(new Zeker(" أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق . (ثلاثا)", 3));

        masa.add(new Zeker(" بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم . (ثلاثاً) ", 3));

        masa.add(new Zeker(" سُبْحـانَ اللهِ عَدَدَ خَلْـقِه ، سُبْحـانَ اللهِ َرِضـا نَفْسِـه" +
                " ،  سُبْحـانَ اللهِ َزِنَـةَ عَـرْشِـه ، سُبْحـانَ اللهِ  مِـدادَ كَلِمـاتِـه . (ثلاثاً) ", 3));

        masa.add(new Zeker(" اللّهُـمَّ عافِـني في بَدَنـي " +
                "، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ . (ثلاثاً) ", 3));

        masa.add(new Zeker("اللّهُـمَّ إِنّـي أَعـوذُبِكَ مِنَ الْكُـفر " +
                "، وَالفَـقْر ، واللّهُـمَّ إِنّـي َأَعـوذُبِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ . (ثلاثاً) ", 3));

        masa.add(new Zeker("سور [ الإخلاص والفلق والناس ]  (ثلاثا)", 3));

        masa.add(new Zeker(" حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم . ( سبع مَرّات ) ", 7));

        masa.add(new Zeker(" لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شَـريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْـد، وهُوَ على كُلّ شَيءٍ قَدير . (عشر مرات) ", 10));

        masa.add(new Zeker("اللهم صَلِّ على سيدنا محمدِ (عشر مرات)", 10));

        masa.add(new Zeker(" سُبْحـانَ اللهِ وَبِحَمْـدِهِ . (مائة مرة) ", 100));

        //endregion


    }

    public ArrayList<Zeker> getSabah() {
        return sabah;
    }

    public ArrayList<Zeker> getMasa() {
        return masa;
    }
}
